benchmarks/suites/csv-processor/artillery/test-ecs.yml
config:
  target: "https://REPLACE_ME"
  processor: "./processor.js"

  # ============================================================
  # Load test phases for CSV processor. Identical across platforms:
  # - EC2: c6i.large host, container capped at 1 vCPU / 1024 MB
  # - ECS: task 1024 CPU units (1 vCPU) / 1024 MB on a c6i.large
  # - Lambda: 1769 MB (one full vCPU), reserved concurrency 1
  # Every platform serves with exactly one 1-vCPU worker.
  # ============================================================
  phases:
  # Measured service time, 2026-08-04: EC2 14.39 ms, ECS 15.02 ms,
  # Lambda 22.73 ms -> ceilings 69 / 67 / 44 req/s. Lambda binds.
  #
  # arrivalCount, not arrivalRate: arrivalRate starts N virtual users at the same
  # instant each second, which a Lambda sandbox at concurrency 1 cannot absorb.
  # At 12 req/s: 234 HTTP 502s with arrivalRate, 3 with arrivalCount.
  #
  # No phase crosses a ceiling. Saturation is Experiment B, run per platform.
  # One request per arrival, so arrivals == requests.

    # Warm-up at the primary rate. Warming lower leaves a step change whose
    # transient falls inside the reported window. Discarded.
    - duration: 180
      arrivalCount: 3600

    # Probe, 5 req/s (7% EC2/ECS, 11% Lambda) - shapes the latency-vs-load curve.
    - duration: 240
      arrivalCount: 1200

    # Probe, 10 req/s (14% / 23%).
    - duration: 240
      arrivalCount: 2400

    # Primary operating point, 20 req/s (29% / 45%). Source of every reported
    # latency figure; 14400 requests so the P99 has ~144 tail samples.
    - duration: 720
      arrivalCount: 14400

    # Probe, 30 req/s (43% / 68%). Closest approach to Lambda's ceiling; any
    # throttling here is a result, not a misconfiguration.
    - duration: 240
      arrivalCount: 7200

  defaults:
    headers:
      Host: csv-ecs.bench.local
    http:
      timeout: 60

  plugins:
    publish-metrics:
      - type: prometheus
        pushgateway: "http://localhost:9192"
        testName: "csv-processor-load-test"
        environment: "production"
        labels:
          service: "csv-processor-service"
          scenario: "process-csv-formdata"
          instance: ecs
# ============================================================
# Scenarios
# ============================================================
scenarios:
  - name: Processar CSV via form-data manual
    flow:
      - post:
          url: "/process"
          beforeRequest: "buildCsvRequest"