benchmarks/suites/csv-processor/artillery/test-lambda.yml
config:
  target: "https://REPLACE_ME"
  processor: "./processor.js"

  # ============================================================
  # Load test phases for CSV processor. Identical across platforms:
  # - EC2: c6i.large host, container capped at 1 vCPU / 1024 MB
  # - ECS: task 1024 CPU units (1 vCPU) / 1024 MB on a c6i.large
  # - Lambda: 1769 MB (one full vCPU), reserved concurrency 1
  # Every platform serves with exactly one 1-vCPU worker.
  # ============================================================
  phases:
  # Measured 2026-08-04. Service time and resulting ceiling for one worker:
  #   EC2 14.4 ms -> 69 req/s   ECS 15.0 ms -> 67 req/s
  #   Lambda 35.8 ms -> 28 req/s   <- binding, and measured by CloudWatch
  #   Duration, not the in-app timer: a concurrency slot is held for the whole
  #   invocation. The in-app 22.7 ms overstates the ceiling as 44 req/s.
  #
  # arrivalCount, not arrivalRate: arrivalRate starts N virtual users at the same
  # instant each second, which one Lambda sandbox cannot absorb. At 12 req/s:
  # 234 HTTP 502s with arrivalRate, 3 with arrivalCount.
  #
  # Observed throttling at reserved concurrency 1: none at 5 or 10 req/s, ~15% at
  # 20 (71% utilisation), ~50% at 30 (above capacity). The primary rate sits at
  # half of Lambda's ceiling so its latency is not measured over survivors only.
  #
  # One request per arrival, so arrivals == requests.

    # Warm-up at the primary rate. Warming lower leaves a step change whose
    # transient falls inside the reported window. Discarded.
    - duration: 120
      arrivalCount: 1680

    # Probe, 4 req/s - 14% of Lambda's ceiling, 6% of EC2/ECS.
    - duration: 150
      arrivalCount: 600

    # Probe, 8 req/s - 29% / 12%.
    - duration: 150
      arrivalCount: 1200

    # Primary operating point, 14 req/s - 50% of Lambda's ceiling, 20% of
    # EC2/ECS. Source of every reported latency figure; 6720 requests.
    - duration: 480
      arrivalCount: 6720

    # Probe, 20 req/s - 71% of Lambda's ceiling. Closest approach to the knee.
    # Throttling here is a result, not a misconfiguration; report it.
    - duration: 150
      arrivalCount: 3000

  defaults:
    headers:
      Host: csv-lambda.bench.local
    http:
      timeout: 60

  plugins:
    publish-metrics:
      - type: prometheus
        pushgateway: "http://localhost:9194"
        testName: "csv-processor-load-test"
        environment: "production"
        labels:
          service: "csv-processor-service"
          scenario: "process-csv-formdata"
          instance: lambda
# ============================================================
# Scenarios
# ============================================================
scenarios:
  - name: Processar CSV via form-data manual
    flow:
      - post:
          url: "/process"
          beforeRequest: "buildCsvRequest"